; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f16-p16-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
             p10 p11 p12 p13 p14 p15 - passenger
             f0 f1 f2 f3 f4 f5 f6 f7 f8 f9 
             f10 f11 f12 f13 f14 f15 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)
(above f0 f7)
(above f0 f8)
(above f0 f9)
(above f0 f10)
(above f0 f11)
(above f0 f12)
(above f0 f13)
(above f0 f14)
(above f0 f15)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)
(above f1 f7)
(above f1 f8)
(above f1 f9)
(above f1 f10)
(above f1 f11)
(above f1 f12)
(above f1 f13)
(above f1 f14)
(above f1 f15)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)
(above f2 f7)
(above f2 f8)
(above f2 f9)
(above f2 f10)
(above f2 f11)
(above f2 f12)
(above f2 f13)
(above f2 f14)
(above f2 f15)

(above f3 f4)
(above f3 f5)
(above f3 f6)
(above f3 f7)
(above f3 f8)
(above f3 f9)
(above f3 f10)
(above f3 f11)
(above f3 f12)
(above f3 f13)
(above f3 f14)
(above f3 f15)

(above f4 f5)
(above f4 f6)
(above f4 f7)
(above f4 f8)
(above f4 f9)
(above f4 f10)
(above f4 f11)
(above f4 f12)
(above f4 f13)
(above f4 f14)
(above f4 f15)

(above f5 f6)
(above f5 f7)
(above f5 f8)
(above f5 f9)
(above f5 f10)
(above f5 f11)
(above f5 f12)
(above f5 f13)
(above f5 f14)
(above f5 f15)

(above f6 f7)
(above f6 f8)
(above f6 f9)
(above f6 f10)
(above f6 f11)
(above f6 f12)
(above f6 f13)
(above f6 f14)
(above f6 f15)

(above f7 f8)
(above f7 f9)
(above f7 f10)
(above f7 f11)
(above f7 f12)
(above f7 f13)
(above f7 f14)
(above f7 f15)

(above f8 f9)
(above f8 f10)
(above f8 f11)
(above f8 f12)
(above f8 f13)
(above f8 f14)
(above f8 f15)

(above f9 f10)
(above f9 f11)
(above f9 f12)
(above f9 f13)
(above f9 f14)
(above f9 f15)

(above f10 f11)
(above f10 f12)
(above f10 f13)
(above f10 f14)
(above f10 f15)

(above f11 f12)
(above f11 f13)
(above f11 f14)
(above f11 f15)

(above f12 f13)
(above f12 f14)
(above f12 f15)

(above f13 f14)
(above f13 f15)

(above f14 f15)



(origin p0 f0)
(destin p0 f13)

(origin p1 f11)
(destin p1 f5)

(origin p2 f0)
(destin p2 f12)

(origin p3 f6)
(destin p3 f13)

(origin p4 f8)
(destin p4 f2)

(origin p5 f10)
(destin p5 f5)

(origin p6 f11)
(destin p6 f2)

(origin p7 f9)
(destin p7 f12)

(origin p8 f12)
(destin p8 f3)

(origin p9 f8)
(destin p9 f15)

(origin p10 f13)
(destin p10 f5)

(origin p11 f1)
(destin p11 f8)

(origin p12 f13)
(destin p12 f5)

(origin p13 f2)
(destin p13 f7)

(origin p14 f2)
(destin p14 f9)

(origin p15 f7)
(destin p15 f15)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
(served p5)
(served p6)
(served p7)
(served p8)
(served p9)
(served p10)
(served p11)
(served p12)
(served p13)
(served p14)
(served p15)
))
)

; plan
1. (board f0 p2)
   added: (boarded p2)
   goals met: 0 of 16
2. (board f0 p0)
   added: (boarded p0)
   goals met: 0 of 16
3. (up f0 f1)
   deleted: (lift-at f0)
   added: (lift-at f1)
   goals met: 0 of 16
4. (board f1 p11)
   added: (boarded p11)
   goals met: 0 of 16
5. (up f1 f8)
   deleted: (lift-at f1)
   added: (lift-at f8)
   goals met: 0 of 16
6. (depart f8 p11)
   deleted: (boarded p11)
   added: (served p11)
   goals met: 1 of 16
7. (board f8 p9)
   added: (boarded p9)
   goals met: 1 of 16
8. (board f8 p4)
   added: (boarded p4)
   goals met: 1 of 16
9. (down f8 f6)
   deleted: (lift-at f8)
   added: (lift-at f6)
   goals met: 1 of 16
10. (board f6 p3)
   added: (boarded p3)
   goals met: 1 of 16
11. (up f6 f13)
   deleted: (lift-at f6)
   added: (lift-at f13)
   goals met: 1 of 16
12. (depart f13 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 2 of 16
13. (depart f13 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 3 of 16
14. (board f13 p12)
   added: (boarded p12)
   goals met: 3 of 16
15. (board f13 p10)
   added: (boarded p10)
   goals met: 3 of 16
16. (down f13 f10)
   deleted: (lift-at f13)
   added: (lift-at f10)
   goals met: 3 of 16
17. (board f10 p5)
   added: (boarded p5)
   goals met: 3 of 16
18. (up f10 f11)
   deleted: (lift-at f10)
   added: (lift-at f11)
   goals met: 3 of 16
19. (board f11 p1)
   added: (boarded p1)
   goals met: 3 of 16
20. (board f11 p6)
   added: (boarded p6)
   goals met: 3 of 16
21. (down f11 f2)
   deleted: (lift-at f11)
   added: (lift-at f2)
   goals met: 3 of 16
22. (board f2 p13)
   added: (boarded p13)
   goals met: 3 of 16
23. (board f2 p14)
   added: (boarded p14)
   goals met: 3 of 16
24. (depart f2 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 4 of 16
25. (depart f2 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 5 of 16
26. (up f2 f5)
   deleted: (lift-at f2)
   added: (lift-at f5)
   goals met: 5 of 16
27. (depart f5 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 6 of 16
28. (depart f5 p10)
   deleted: (boarded p10)
   added: (served p10)
   goals met: 7 of 16
29. (depart f5 p12)
   deleted: (boarded p12)
   added: (served p12)
   goals met: 8 of 16
30. (depart f5 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 9 of 16
31. (up f5 f7)
   deleted: (lift-at f5)
   added: (lift-at f7)
   goals met: 9 of 16
32. (board f7 p15)
   added: (boarded p15)
   goals met: 9 of 16
33. (depart f7 p13)
   deleted: (boarded p13)
   added: (served p13)
   goals met: 10 of 16
34. (up f7 f15)
   deleted: (lift-at f7)
   added: (lift-at f15)
   goals met: 10 of 16
35. (depart f15 p15)
   deleted: (boarded p15)
   added: (served p15)
   goals met: 11 of 16
36. (depart f15 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 12 of 16
37. (down f15 f9)
   deleted: (lift-at f15)
   added: (lift-at f9)
   goals met: 12 of 16
38. (board f9 p7)
   added: (boarded p7)
   goals met: 12 of 16
39. (depart f9 p14)
   deleted: (boarded p14)
   added: (served p14)
   goals met: 13 of 16
40. (up f9 f12)
   deleted: (lift-at f9)
   added: (lift-at f12)
   goals met: 13 of 16
41. (board f12 p8)
   added: (boarded p8)
   goals met: 13 of 16
42. (depart f12 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 14 of 16
43. (depart f12 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 15 of 16
44. (down f12 f3)
   deleted: (lift-at f12)
   added: (lift-at f3)
   goals met: 15 of 16
45. (depart f3 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 16 of 16
